{
	"Applications": [
		{
			"name": "BART-Now",
			"img": "./assets/images/bartnow.png",
			"body": "BART-Now is a transit app that allows commuters to instantly access relevant data on the go. It greets the user with the BART (Bay Area Rapid Transit) station nearest to their location, along with a list of the nearest departing trains. It also offers routing information, live countdowns for depatures, and calculates the chance that the user will make any particular train in time.",
			"link": "https://yiyi098.github.io/BART-Now",
			"source": "https://github.com/yiyi098/BART-Now"
		},
		{
			"name": "World Outlook",
			"img": "./assets/images/wo.png",
			"body": "﻿World Outlook is a Windows desktop application designed to help users organize their notes, projects, and documentation in the security of their own hard-drive. It provides a wiki-like format in which entries are organized by \"tags,\" allowing for quick and intuitive searching and filtering. It is being developed mostly in C# using the WPF .NET framework.",
			"link": "",
			"source": "https://github.com/nwactor/WorldOutlook"
		},
		{
			"name": "Therify",
			"img": "./assets/images/therify.png",
			"body": "﻿Therify is a cross-platform mobile app that allows users to upload photos that with verfied locations and timestamps that can then be viewed by others using the app. It provides access to reliable images of destinations that can be commented on and rated by users.",
			"link": "https://expo.io/@nwactor/therify",
			"source": "https://github.com/nwactor/WorldOutlook"
		},
		{
			"name": "Wellsent",
			"img": "./assets/images/wellsent.png",
			"body": "Wellsent is a prototype for a secure messaging app that provides custom encryption for server-side messages so that users don't have to worry about the app's owners accessing their data. It uses a Node/Express/MySQL stack.",
			"link": "https://wellsent.herokuapp.com/",
			"source": "https://github.com/nwactor/wellsent"
		},
		{
			"name": "Checkers+",
			"img": "./assets/images/checkers.png",
			"body": "Checkers+ is an Android app that allows the user to play checkers against their friends locally, or against the computer. It was created in fall 2016 for a course in mobile applications at Brandeis University. Checkers+ is fully native, developed using Java in Andriod Studio.",
			"link": "",
			"source": "https://github.com/nwactor/CheckersPlus"
		}
	],
	"Small Projects": [
		{
			"name": "Gifs by Nationallity",
			"img": "./assets/images/gifpage.png",
			"body": "A funny and somewhat informative webpage that allows vistors to view top trending gifs of several preset countries. It also gives the option to search for any other countries the user is interested in, as well. Gifs are courtesy of the Giphy API.",
			"link": "https://nwactor.github.io/GifPage/",
			"source": "https://github.com/nwactor/GifPage"
		},
		{
			"name": "Space Trivia",
			"img": "./assets/images/trivia.jpg",
			"body": "A short game that tests your knowledge of space and cosmology. Try to not run out of time! Space Trivia is the result of practicing Javascript's setInterval function.",
			"link": "https://nwactor.github.io/TriviaGame/",
			"source": "https://github.com/nwactor/TriviaGame"
		},
		{
			"name": "Star Wars RPG",
			"img": "./assets/images/starwars.png",
			"body": "Another short game that asks you to pick your favorite Star Wars character and battle against the rest of them. The trick to the game is picking the right order in which to fight your opponents, as each character has unique stats, and each grows more powerful at a different rate after every round of combat. The game is on a standard webpage, powered by a lot of jQuery.",
			"link": "https://nwactor.github.io/star-wars-rpg/",
			"source": "https://github.com/nwactor/star-wars-rpg"
		}
	],
	"Games": [
		{
			"name": "Space Miner",
			"img": "./assets/images/spaceminer.png",
			"body": "Space Miner is a 3D browser game powered by the three.js library. player pilots a space ship through a field of asteroids, collecting free-floating chunks of gold and writhing clusters of plasma. The game ends when the player either crashes into an asteroid, or collects enough treasure to win. It features original 3D models and a randomly generated asteroid field.",
			"link": "https://nwactor.github.io/Space-Miner/",
			"source": "https://github.com/nwactor/Space-Miner"
		},
		{
			"name": "Diplomacy",
			"img": "./assets/images/dip.png",
			"body": "\"Luck plays no part in Diplomacy\". Diplomacy, a board game in which no alliance is sacred and players are classically tasked with taking over as much of Europe as possible, exists today with many online adaptations. Creating new maps, or \"variants\" of the game requires extreme attention to map balance and visual clarity, as well as some programming in PHP. My creations are Atlantic Colonies, Cold War, and War of Austrian Succession.",
			"link": "",
			"source": ""
		},
		{
			"name": "The Arena",
			"img": "./assets/images/arena.png",
			"body": "Created in Unreal Engine 4, The Arena is a gladiator simulator in which players fight endless waves of enemies in an attempt to beat the high score. It uses original scripts to power combat, inventory, and movement systems.",
			"link": "",
			"source": ""
		},
		{
			"name": "Bowman",
			"img": "./assets/images/bowman.png",
			"body": "Bowman is a 3D adventure game created in Blender, in which the player must explore hand-crafted levels, avoiding barbaians, jumping from rock to rock across rivers of lava, and defeating enemies, relying on only their skill with the bow and arrow. The game culminates in a battle against an evil fire-giant inside of a volcano with rising lava.",
			"link": "",
			"source": ""
		}
	]
}